bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21E17A.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2018 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2018-11-30T04:39:09Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="SAMC21E17A-MU" mhc:ordercode="ATSAMC21E17A-MU" package="QFN32" pinout="SAMC21E" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="SAMC21E17A-MN" mhc:ordercode="ATSAMC21E17A-MN" package="QFN32" pinout="SAMC21E" speedmax="48000000" tempmin="-40" tempmax="105" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="SAMC21E17A-MZ" mhc:ordercode="ATSAMC21E17A-MZ" package="QFN32" pinout="SAMC21E" speedmax="48000000" tempmin="-40" tempmax="125" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="SAMC21E17A-AU" mhc:ordercode="ATSAMC21E17A-AU" package="TQFP32" pinout="SAMC21E" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="SAMC21E17A-AN" mhc:ordercode="ATSAMC21E17A-AN" package="TQFP32" pinout="SAMC21E" speedmax="48000000" tempmin="-40" tempmax="105" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="SAMC21E17A-AZ" mhc:ordercode="ATSAMC21E17A-AZ" package="TQFP32" pinout="SAMC21E" speedmax="48000000" tempmin="-40" tempmax="125" vccmin="2.7" vccmax="5.5"/>
  </variants>
  <devices>
    <device name="ATSAMC21E17A" architecture="CORTEX-M0PLUS" family="SAMC" series="SAMC21">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x20000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="RWW" start="0x00400000" size="0x1000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x4000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="DIVAS" start="0x48000000" size="0x20" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x20000000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="NUM_IRQ" value="31" caption="Number of interrupt request lines"/>
        <param name="__CM0PLUS_REV" value="0x0001" caption="Cortex-M0+ Core Revision"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__NVIC_PRIO_BITS" value="2" caption="Number of Bits used for Priority Levels"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
        <param name="__DEVICE_IS_SAM" value="1"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2245" version="1.1.1">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42005000"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA04"/>
              <signal group="AIN" index="1" function="B" pad="PA05"/>
              <signal group="AIN" index="2" function="B" pad="PA06"/>
              <signal group="AIN" index="3" function="B" pad="PA07"/>
              <signal group="AIN" index="4" function="B" pad="PA02"/>
              <signal group="AIN" index="5" function="B" pad="PA03"/>
              <signal group="CMP" index="0" function="H" pad="PA18"/>
              <signal group="CMP" index="1" function="H" pad="PA19"/>
              <signal group="CMP" index="2" function="H" pad="PA00"/>
              <signal group="CMP" index="2" function="H" pad="PA24"/>
              <signal group="CMP" index="3" function="H" pad="PA01"/>
              <signal group="CMP" index="3" function="H" pad="PA25"/>
            </signals>
            <parameters>
              <param name="COMPCTRL_MUXNEG_OPAMP" value="7" caption="OPAMP selection for MUXNEG"/>
              <param name="GCLK_ID" value="40" caption="Index of Generic Clock"/>
              <param name="NUM_CMP" value="4" caption="Number of comparators"/>
              <param name="PAIRS" value="2" caption="Number of pairs of comparators"/>
              <param name="SPEED_LEVELS" value="2" caption="Number of speed values"/>
              <param name="INSTANCE_ID" value="84"/>
            </parameters>
          </instance>
        </module>
